#pragma once
#include <vector>
#include "Figure.h"

/**
* @brief Клас за управление на списък от SVG фигури.
* Съхранява указатели към обекти от тип Figure и се грижи за 
* правилното заделяне и освобождаване на динамична памет.
*/
class FigureList {
private:
	std::vector<Figure*> list; ///< Динамичен масив от указатели към базовия клас Figure

	/**
	* @brief Помощна функция за размяна на данните между два списъка.
	* Използва се за реализиране на оператора за присвояване.
	* @param other Другият списък, с който се разменят данните.
	*/
	void swap(FigureList& other);
public:
	/**
	* @brief Конструктор по подразбиране.
	*/
	FigureList();

	/**
	* @brief Деструктор.
	* Грижи се за правилното освобождаване на динамично заделената памет за всяка фигура в списъка.
	*/
	~FigureList();

	/**
	* @brief Конструктор за копиране.
	* Реализира дълбоко копиране на всички фигури в списъка чрез виртуалния метод clone().
	* @param other Списъкът, от който ще се копират фигурите.
	*/
	FigureList(const FigureList& other);

	/**
	* @brief Оператор за присвояване.
	* @param other Списъкът, от който ще се присвояват данните.
	* @return FigureList& Референция към текущия (променен) обект.
	*/
	FigureList& operator=(const FigureList& other);

	/**
	* @brief Изчиства списъка с фигури и освобождава паметта.
	* @details Обхожда масива, изтрива всички динамично заделени обекти и прави списъка празен.
	*/
	void clear();

	/**
	* @brief Записва всички фигури от списъка в изходен поток.
	* @details Обхожда списъка и извиква виртуалния метод save() за всяка отделна фигура.
	* @param out Изходният поток (например файлов поток), в който ще се записват данните.
	*/
	void save(std::ostream& out) const;

	/**
	* @brief Връща типа на фигурата с пореден номер <n>.
	* @param n Поредният номер на фигурата.
	* @return std::string Типът на фигурата или празен низ "", ако индексът е невалиден.
	*/
	std::string getFigureType(int n) const;

	/**
	* @brief Извежда на екрана всички фигури.
	* Обхожда списъка и вика метода print() за всяка отделна фигура.
	*/
	void print() const;

	/**
	* @brief Създава нова фигура. Добавя нова фигура към списъка.
	* @param newFigure Указател към динамично създадената фигура, която ще се добави.
	* @return Поредния номер на създадената фигура. Размера на списъка.
	*/
	std::size_t create(Figure* newFigure);

	/**
	* @brief Изтрива фигура с пореден номер <n>.
	* @param n Поредният номер на фигурата.
	* @return true Ако фигурата е намерена и успешно изтрита.
	* @return false Ако няма фигура с такъв номер (индексът е извън границите).
	*/
	bool erase(int n);

	/**
	* @brief Транслира фигурата с пореден номер <n>
	* @param n Поредният номер на фигурата.
	* @param horizontal Стойност за местене по хоризонтала (X).
	* @param vertical Стойност за местене по вертикала (Y).
	* @return true Ако фигурата е намерена и успешно преместена.
	* @return false Ако няма фигура с такъв номер (индексът е извън границите).
	*/
	bool translate(int n, double horizontal = 0, double vertical = 0);

	/**
	* @brief Транслира всички фигури в списъка.
	* @param horizontal Стойност за местене по хоризонтала (X) за всички фигури.
	* @param vertical Стойност за местене по вертикала (Y) за всички фигури.
	*/
	void translate(double horizontal = 0, double vertical = 0);

	/**
	* @brief Извежда на екрана всички фигури, които изцяло се съдържат в правоъгълен регион.
	* @param x Абсциса на горния ляв ъгъл на правоъгълника.
	* @param y Ордината на горния ляв ъгъл на правоъгълника.
	* @param width Ширина на правоъгълника.
	* @param height Височина на правоъгълника.
	*/
	void withinRectangle(double x, double y, double width, double height);

	/**
	* @brief Извежда на екрана всички фигури, които изцяло се съдържат в кръгов регион.
	* @param cx Абсциса на центъра на кръгa.
	* @param cy Ордината на центъра на кръгa.
	* @param r Радиус на кръгa.
	*/
	void withinCircle(double cx, double cy, double r);
};