#pragma once
#include <string>

class SvgEditor {
private:
	std::string currentFilePath; ///< Пътят до текущо отворения файл. Ако няма такъв е празен стринг
	std::string command; ///< Последната въведена команда


	/**
	 * @brief Взима само името на файла от целия път.
	 * @param path Пълният път.
	 * @return Името на файла заедно с разширението.
	 */
	std::string getFileName(const std::string& filePath) const;

	/**
	 * @brief Отваря SVG файл въз основа на въведен от потребителя път.
	 * @details Ако подаденият файл не съществува, създава нов празен файл.
	 * 
	 */
	//CHANGE HAPPENED
	void open(std::string& path);

	/// Затваря текущия файл. Промените не се запазват автоматично.
	void close();

	/// Записва всички промени в текущо отворения файл.
	void save();

	/**
	 * @brief Записва текущите данни в напълно нов файл.
	 * @details Изисква от потребителя да въведе нов валиден път, където да бъде запазена информацията.
	 */
	void saveAs();

	/// Извежда на екрана списък с всички възможни команди.
	void help();

public:
	/**
	 * @brief Пуска основния цикъл на програмата.
	 * @details Чете и изпълнява команди от конзолата, докато не се въведе "exit".
	 */
	void start();
};